import React from 'react'
import { useParams } from 'react-router-dom'
import axios from 'axios'
import { Link } from "react-router-dom";
import { useDispatch, useSelector } from "react-redux";
import { addItem , minusItem} from "../redux/slices/cartSlice";


const ProductList: React.FC = () => {
  const [product,setProduct] = React.useState <{
    imageUrl: string;
    title: string;
    price: number;
    barcode: string;
    manufacturer: string;
    brand: string;
    weight: string;
    icon: string
  }>();
  const dispatch = useDispatch();
  // const {totalPrice, items} = useSelector((data )=> data.cart)


  const {id} = useParams();
  // let count2 = items[0].count;
  // console.log(count2)
  React.useEffect(() => {
    async function fetchProduct() {
      try {
        const { data } = await axios.get('https://642a9b1000dfa3b54749b441.mockapi.io/items/' + id);
        setProduct(data);
        console.log(data)
      } catch (error) {
        alert('Ошибка при получении данных!');
        // navigate('/');
      }
    }

    fetchProduct();
  }, []);
  if (!product) {
    return <>Загрузка...</>;
  }
 
  // const onClickPlus = () => {
  //   dispatch(
  //     addItem(
  //       id
  //     )
  //   );
  // };
  // const onClickMinus = () => {
  //   dispatch(minusItem (id));
  // };


  return (
    <div> <div className="breadcrumbs">
    <ul className="breadcrumbs-list">
      <li>
        <Link to="/">Главная</Link>
      </li>
      <li>
        <a href="">
          <svg
            width="2"
            height="17"
            viewBox="0 0 2 17"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              opacity="0.3"
              d="M1 0.5V16.5"
              stroke="#3F4E65"
              stroke-dasharray="2 2"
            />
          </svg>
        </a>
      </li>
      <li>
        <Link to="/">Каталог</Link>
      </li>
      <li>
        <a href="">
          <svg
            width="2"
            height="17"
            viewBox="0 0 2 17"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              opacity="0.3"
              d="M1 0.5V16.5"
              stroke="#3F4E65"
              stroke-dasharray="2 2"
            />
          </svg>
        </a>
      </li>
      <li>
        <a href="">{product.title}</a>
      </li>
    </ul>
  </div>
  
  
  <div className='productList'>
  
  <div className="productList__img">
  <img src={product.imageUrl} alt="" />
    </div> 
    <div className="productList__info">
        <div className="available">
        В наличии
        </div>
        <div className="productList__title">
          <strong>{product.manufacturer}</strong> {product.title}
        </div>
        <div className="product__size">
    <img src={product.icon} alt="" />

    <div>{product.weight}</div>
  </div>
  <div className="cart__item">
  <div className="cart__item-price">
    <b>{product.price} ₸ </b>
  </div>
  <div className="cart__item-count">
    <button 
     
      className="button button--outline button--circle cart__item-count-minus small">
      <svg
        width="10"
        height="10"
        viewBox="0 0 10 10"
        fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <path
          d="M5.92001 3.84V5.76V8.64C5.92001 9.17016 5.49017 9.6 4.96001 9.6C4.42985 9.6 4.00001 9.17016 4.00001 8.64L4 5.76L4.00001 3.84V0.96C4.00001 0.42984 4.42985 0 4.96001 0C5.49017 0 5.92001 0.42984 5.92001 0.96V3.84Z"
          fill="#787878"></path>
        <path
          d="M5.75998 5.92001L3.83998 5.92001L0.959977 5.92001C0.429817 5.92001 -2.29533e-05 5.49017 -2.29301e-05 4.96001C-2.2907e-05 4.42985 0.429817 4.00001 0.959977 4.00001L3.83998 4L5.75998 4.00001L8.63998 4.00001C9.17014 4.00001 9.59998 4.42985 9.59998 4.96001C9.59998 5.49017 9.17014 5.92001 8.63998 5.92001L5.75998 5.92001Z"
          fill="#787878"></path>
      </svg>
    </button>


    <b>0</b>


    <button 
     
      className="button button--outline button--circle cart__item-count-plus small">
      <svg
        width="10"
        height="10"
        viewBox="0 0 10 10"
        fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <path
          d="M5.92001 3.84V5.76V8.64C5.92001 9.17016 5.49017 9.6 4.96001 9.6C4.42985 9.6 4.00001 9.17016 4.00001 8.64L4 5.76L4.00001 3.84V0.96C4.00001 0.42984 4.42985 0 4.96001 0C5.49017 0 5.92001 0.42984 5.92001 0.96V3.84Z"
          fill="#787878"></path>
        <path
          d="M5.75998 5.92001L3.83998 5.92001L0.959977 5.92001C0.429817 5.92001 -2.29533e-05 5.49017 -2.29301e-05 4.96001C-2.2907e-05 4.42985 0.429817 4.00001 0.959977 4.00001L3.83998 4L5.75998 4.00001L8.63998 4.00001C9.17014 4.00001 9.59998 4.42985 9.59998 4.96001C9.59998 5.49017 9.17014 5.92001 8.63998 5.92001L5.75998 5.92001Z"
          fill="#787878"></path>
      </svg>
    </button>
  </div>
 <Link to="/cart"><div>
  <svg width="184" height="59" viewBox="0 0 184 59" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="184" height="59" rx="29.5" fill="#FFC85E"/>
<path d="M40.3849 35H44.7351C47.022 35 48.2401 33.8068 48.2401 32.1861C48.2401 30.6797 47.1612 29.7699 46.0028 29.7152V29.6158C47.0618 29.3771 47.8423 28.6264 47.8423 27.4283C47.8423 25.902 46.7088 24.8182 44.4616 24.8182H40.3849V35ZM42.5376 33.2401V30.5355H44.3423C45.3764 30.5355 46.0178 31.1321 46.0178 31.9723C46.0178 32.7379 45.4957 33.2401 44.2926 33.2401H42.5376ZM42.5376 29.0788V26.5582H44.1733C45.1278 26.5582 45.6697 27.0504 45.6697 27.7862C45.6697 28.5916 45.0135 29.0788 44.1335 29.0788H42.5376ZM52.8413 35H54.9592V32.2905H55.7496L57.6339 35H60.1495L57.4201 31.152L60.1197 27.3636H57.6339L55.5558 30.3267H54.9592V27.3636H52.8413V35ZM64.1802 35.1491C66.497 35.1491 67.9387 33.5632 67.9387 31.2116C67.9387 28.8452 66.497 27.2642 64.1802 27.2642C61.8635 27.2642 60.4217 28.8452 60.4217 31.2116C60.4217 33.5632 61.8635 35.1491 64.1802 35.1491ZM64.1902 33.5085C63.1213 33.5085 62.5744 32.5291 62.5744 31.1967C62.5744 29.8643 63.1213 28.88 64.1902 28.88C65.2392 28.88 65.786 29.8643 65.786 31.1967C65.786 32.5291 65.2392 33.5085 64.1902 33.5085ZM69.3159 37.8636H71.4338V33.777H71.4984C71.7917 34.4134 72.4331 35.1243 73.666 35.1243C75.4061 35.1243 76.7633 33.7472 76.7633 31.1918C76.7633 28.5668 75.3464 27.2642 73.671 27.2642C72.3933 27.2642 71.7818 28.0249 71.4984 28.6463H71.4039V27.3636H69.3159V37.8636ZM71.389 31.1818C71.389 29.8196 71.9657 28.9496 72.9949 28.9496C74.0439 28.9496 74.6007 29.8594 74.6007 31.1818C74.6007 32.5142 74.0339 33.4389 72.9949 33.4389C71.9757 33.4389 71.389 32.544 71.389 31.1818ZM77.7825 32.8374C77.8372 34.3288 79.1845 35.1491 81.019 35.1491C82.8983 35.1491 84.2456 34.304 84.2456 32.8821C84.2456 31.8182 83.4849 31.152 82.5502 31.0923V31.0128C83.4998 30.7841 84.0616 30.2273 84.0616 29.4169C84.0616 28.0845 82.9082 27.2642 81.0389 27.2642C79.3287 27.2642 78.0012 28.1293 77.9863 29.5014H80.0297C80.0446 29.054 80.502 28.7408 81.1333 28.7408C81.7598 28.7408 82.1525 29.0888 82.1525 29.6009C82.1525 30.0632 81.7846 30.4013 81.1284 30.4013H80.0297V31.7884H81.1284C81.7896 31.7884 82.2321 32.1662 82.2321 32.718C82.2321 33.3246 81.7001 33.6527 81.0091 33.6527C80.3279 33.6527 79.8556 33.3445 79.8358 32.8374H77.7825ZM87.5678 32.206V27.3636H85.5444V35H87.6474L90.3867 30.1428V35H92.4052V27.3636H90.3171L87.5678 32.206ZM96.1264 27.3636H94.103V35H96.1264V32.0021H98.7365V35H100.745V27.3636H98.7365V30.3366H96.1264V27.3636ZM103.422 37.8636C104.998 37.8636 105.833 37.0582 106.266 35.8253L109.234 27.3736L106.992 27.3636L105.396 32.9716H105.316L103.735 27.3636H101.508L104.248 35.2188L104.123 35.5419C103.845 36.2578 103.313 36.2926 102.567 36.0639L102.09 37.6449C102.393 37.7741 102.885 37.8636 103.422 37.8636Z" fill="white"/>
<path d="M142.326 24.893C142.196 24.7115 142.021 24.6208 141.803 24.6208H127.878L127.5 23.6369C127.404 23.3143 127.274 23.0388 127.11 22.8103C126.946 22.5818 126.772 22.4205 126.587 22.3264C126.403 22.2323 126.242 22.1685 126.105 22.1349C125.969 22.1013 125.832 22.0845 125.695 22.0845H122.886C122.708 22.0845 122.558 22.145 122.435 22.2659C122.312 22.3869 122.25 22.5415 122.25 22.7296C122.25 22.8372 122.277 22.9413 122.332 23.0421C122.387 23.1429 122.465 23.2202 122.568 23.274C122.67 23.3278 122.776 23.3546 122.886 23.3546H125.695C125.75 23.3546 125.801 23.3614 125.849 23.3748C125.897 23.3882 125.962 23.4454 126.044 23.5462C126.126 23.647 126.194 23.7982 126.249 23.9998L129.19 32.0764C129.218 32.1571 129.262 32.2343 129.324 32.3083C129.385 32.3822 129.457 32.4393 129.539 32.4796C129.621 32.52 129.71 32.5401 129.806 32.5401H138.665C138.802 32.5401 138.928 32.4998 139.044 32.4191C139.161 32.3385 139.239 32.2377 139.28 32.1167L142.418 25.4877C142.486 25.2727 142.456 25.0744 142.326 24.893ZM138.214 31.2498H130.318L128.227 25.9111H140.859L138.214 31.2498ZM137.031 33.2398C136.58 33.2398 136.194 33.3977 135.873 33.7136C135.551 34.0294 135.391 34.4092 135.391 34.8527C135.391 35.2963 135.551 35.676 135.873 35.9918C136.194 36.3077 136.58 36.4656 137.031 36.4656C137.482 36.4656 137.869 36.3077 138.19 35.9918C138.511 35.676 138.672 35.2963 138.672 34.8527C138.672 34.4092 138.511 34.0294 138.19 33.7136C137.869 33.3977 137.482 33.2398 137.031 33.2398ZM131.125 33.2398C130.824 33.2398 130.547 33.3137 130.294 33.4616C130.042 33.6094 129.843 33.8043 129.7 34.0463C129.556 34.2882 129.484 34.557 129.484 34.8527C129.484 35.2963 129.645 35.676 129.966 35.9918C130.288 36.3077 130.674 36.4656 131.125 36.4656C131.576 36.4656 131.962 36.3077 132.284 35.9918C132.605 35.676 132.766 35.2963 132.766 34.8527C132.766 34.7452 132.755 34.6377 132.735 34.5301C132.714 34.4226 132.684 34.3218 132.643 34.2277C132.602 34.1336 132.55 34.0429 132.489 33.9555C132.427 33.8682 132.359 33.7875 132.284 33.7136C132.208 33.6397 132.126 33.5725 132.038 33.512C131.949 33.4515 131.856 33.4011 131.761 33.3608C131.665 33.3204 131.562 33.2902 131.453 33.27C131.344 33.2499 131.234 33.2398 131.125 33.2398Z" fill="white"/>
</svg>

  </div>
  </Link> 
</div>

 
  <div className="product__info">
    Производитель: <b>{product.manufacturer}</b>
  </div>
  <div className="product__info">
    Бренд: <b>{product.brand}</b>
  </div>
  <div className="product__info">
    Штрихкод: <b>{product.barcode}</b>
  </div>
  <div className="cart__item-info">
    <h3>Описание</h3>
    <p>
    Lorem ipsum dolor, sit amet consectetur adipisicing elit. Porro, eaque cum quisquam in dolor blanditiis impedit nesciunt labore incidunt cupiditate corrupti. Fugit ad quaerat obcaecati deserunt, repudiandae id vero quo!
    </p>
  </div>
  <div className="line"></div>
  <div className="cart__item-info">
    <h3>Характеристики</h3>
  </div> 

   <div className="product__info">
    Производитель: <b>{product.manufacturer}</b>
  </div>
  <div className="product__info">
    Бренд: <b>{product.brand}</b>
  </div>
  <div className="product__info">
    Штрихкод: <b>{product.barcode}</b>
  </div>
  <div className="product__info">
    Вес: <b>{product.barcode}</b>
  </div>
  <div className="product__info">
    Объем: <b>{product.barcode}</b>
  </div>
    </div>

   

</div>
  </div>
   
  )
}

export default ProductList